# specify a directory to install
cask_args appdir: "/Applications"

# Install Prerequisites
tap "homebrew/cask-fonts"
brew "mas"
mas "Xcode", id: 497799835

# Brews
brew "svn"
brew "swiftlint"
brew "imagemagick"
brew "iblinter"
brew "jsonlint"
brew "git-flow"
brew "youtube-dl"
brew "ffmpeg"
brew "speedtest-cli"
brew "git-extras"
brew "fastlane"

# Casks
cask "sqlitestudio"
cask "alfred"
cask "spotify"
cask "1password"
cask "iterm2"
cask "calibre"
cask "visual-studio-code"
cask "discord"
cask "whatsapp"
cask "sourcetree"
cask "charles"
cask "macdown"
cask "vlc"
cask "postman"
cask "parallels"
cask "sf-symbols"
cask "omnifocus"
cask "transmission"
cask "transmit"
cask "tunnelblick"
cask "twitch"
cask "pusher"
cask "proxyman"
cask "paw"
cask "fauxpas"
cask "wireshark"
cask "simsim"
cask "little-snitch"
cask "audio-hijack"
cask "istat-menus"
cask "appcleaner"
cask "bartender"
cask "moom"
cask "the-unarchiver"
cask "ifunbox"
cask "imageoptim"
cask "openvpn-connect"
cask "balenaetcher"
cask "sip"
cask "robo-3t"
cask "steam"
cask "origin"
cask "plex"
cask "google-backup-and-sync" # Comment if on work machine

# Quicklook
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "qlimagesize"
cask "WebPQuickLook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
cask "provisionql"
cask "qlcolorcode"
cask "qlplayground"
cask "qlmobi"
cask "quicklookapk"

# Fonts
cask "font-jetbrains-mono"
cask "font-inconsolata"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-g"
cask "font-inconsolata-lgc"
cask "font-inconsolata-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-mono-for-powerline"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hack"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-mono-derivative-powerline"

# Mac App Store
mas "iMovie", id: 408981434
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Things", id: 904280696
mas "Pushever", id: 1455738387
mas "BetterSnapTool", id: 417375580
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "Pixelmator", id: 407963104
mas "CiderTV", id: 1065907486
mas "LocalSites", id: 1289088707
mas "Tot", id: 1491071483
mas "Microsoft Remote Desktop", id: 1295203466
mas "Transporter", id: 1450874784
mas "Pocket", id: 568494494

# Safari Extensions
mas "Save to Pocket", id: 1477385213
mas "Honey", id: 1472777122

# Other optional items
# brew "zsh"
# brew "bash"
# Use this over one shipped with MacOS or from a rbenv equivilent?
# brew "ruby"
# brew "git"
# By default, binaries installed by gem will be placed into:
#     $(brew --prefix)/lib/ruby/gems//bin
# You may want to add this to your PATH.
# brew "tree"
# brew "nvm"
# brew "cocoapods"
# brew "wget"
# brew "zsh-completions"
#To load Zsh completions, add the following to your .zschrc:
#source $(brew --prefix)/opt/git-extras/share/git-extras/git-extras-completion.zsh
# brew "bash-completion"
# brew "lame"
# brew "gradle"
# brew "maven"
# brew "ant"
# cask "android-studio"
# cask "android-platform-tools"
# cask "karabiner-elements"
# cask "google-chat" # Install if on work machine
# cask "google-drive-file-stream" # Install if on work machine
# cask "karabiner-elements"
# cask "java"
# cask "oracle-jdk"
# cask "google-chrome"
# cask "ivpn"
# cask "androidtool"
# cask "synergy"
